Revit 2026 API

# FieldDomainPointsByXYZ Properties

---

The FieldDomainPointsByXYZ type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from FieldDomainPoints) |

#### Reference

FieldDomainPointsByXYZ Class

Autodesk.Revit.DB.Analysis Namespace